You may not create sketch or family constraints between group members and elements which are not members of the same group.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ForbiddenGroupConstraint { get; }
  Visual Basic
Public Shared ReadOnly Property ForbiddenGroupConstraint As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ForbiddenGroupConstraint {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DimensionFailures Class
  Autodesk.Revit.DB Namespace